nxp-mcuxpresso/mcuxsdk-examples/_boards/imx952evk/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitXSPI1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitXSPI1Pins(void) {                           /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA0__FLEXSPI1_A_DATA0_BIT0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA0__FLEXSPI1_A_DATA0_BIT0, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA1__FLEXSPI1_A_DATA0_BIT1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA1__FLEXSPI1_A_DATA0_BIT1, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA2__FLEXSPI1_A_DATA0_BIT2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA2__FLEXSPI1_A_DATA0_BIT2, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA3__FLEXSPI1_A_DATA0_BIT3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA3__FLEXSPI1_A_DATA0_BIT3, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA4__FLEXSPI1_A_DATA0_BIT4, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA4__FLEXSPI1_A_DATA0_BIT4, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA5__FLEXSPI1_A_DATA0_BIT5, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA5__FLEXSPI1_A_DATA0_BIT5, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA6__FLEXSPI1_A_DATA0_BIT6, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA6__FLEXSPI1_A_DATA0_BIT6, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DATA7__FLEXSPI1_A_DATA0_BIT7, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DATA7__FLEXSPI1_A_DATA0_BIT7, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_DQS__FLEXSPI1_A_DQS, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_DQS__FLEXSPI1_A_DQS, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_SCLK__FLEXSPI1_A_SCLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_SCLK__FLEXSPI1_A_SCLK, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_SS0_B__FLEXSPI1_A_SS0_B, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_SS0_B__FLEXSPI1_A_SS0_B, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_XSPI1_SS1_B__FLEXSPI1_A_SS1_B, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_XSPI1_SS1_B__FLEXSPI1_A_SS1_B, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI2C3Pins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: J51, peripheral: LPI2C3, signal: lpi2c_scl, pin_signal: GPIO_IO01, DSE: X4}
  - {pin_num: J49, peripheral: LPI2C3, signal: lpi2c_sda, pin_signal: GPIO_IO00, DSE: X4}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2C3Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI2C3Pins(void) {                            /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO00__LPI2C3_SDA, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO00__LPI2C3_SDA, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO01__LPI2C3_SCL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO01__LPI2C3_SCL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPSPI1Pins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: G49, peripheral: LPSPI1, signal: 'lpspi_pcs, 0', pin_signal: SAI1_TXFS, DSE: X4}
  - {pin_num: G51, peripheral: LPSPI1, signal: lpspi_sin, pin_signal: SAI1_TXC, DSE: X4}
  - {pin_num: H52, peripheral: LPSPI1, signal: lpspi_sout, pin_signal: SAI1_RXD0, DSE: X4}
  - {pin_num: H48, peripheral: LPSPI1, signal: lpspi_sck, pin_signal: SAI1_TXD0, DSE: X4}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPSPI1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPSPI1Pins(void) {                          /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_SAI1_RXD0__LPSPI1_SOUT, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SAI1_RXD0__LPSPI1_SOUT, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_SAI1_TXC__LPSPI1_SIN, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SAI1_TXC__LPSPI1_SIN, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_SAI1_TXD0__LPSPI1_SCK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SAI1_TXD0__LPSPI1_SCK, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_SAI1_TXFS__LPSPI1_PCS0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SAI1_TXFS__LPSPI1_PCS0, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
}


